blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ('rails is awsome', 'it really is', '2024-11-24 19:06:27.311142', '2024-11-24 19:06:27.311142') RETURNING "id"
---
  def create
    @article = Article.new(article_params)

    if @article.save